docs/benchmarks/20260423_233416_compare_c500/run_a_raw.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /script.js
        output: -

     scenarios: (100.00%) 1 scenario, 500 max VUs, 1m30s max duration (incl. graceful stop):
              * booking_stress: 500 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 500/500 VUs, 49926 complete and 0 interrupted iterations
booking_stress   [   2% ] 500 VUs  0m01.0s/1m0s

running (0m02.0s), 500/500 VUs, 105309 complete and 0 interrupted iterations
booking_stress   [   3% ] 500 VUs  0m02.0s/1m0s

running (0m03.0s), 500/500 VUs, 160861 complete and 0 interrupted iterations
booking_stress   [   5% ] 500 VUs  0m03.0s/1m0s

running (0m04.0s), 500/500 VUs, 217871 complete and 0 interrupted iterations
booking_stress   [   7% ] 500 VUs  0m04.0s/1m0s

running (0m05.0s), 500/500 VUs, 275520 complete and 0 interrupted iterations
booking_stress   [   8% ] 500 VUs  0m05.0s/1m0s

running (0m06.0s), 500/500 VUs, 326221 complete and 0 interrupted iterations
booking_stress   [  10% ] 500 VUs  0m06.0s/1m0s

running (0m07.0s), 500/500 VUs, 383709 complete and 0 interrupted iterations
booking_stress   [  12% ] 500 VUs  0m07.0s/1m0s

running (0m08.0s), 500/500 VUs, 440425 complete and 0 interrupted iterations
booking_stress   [  13% ] 500 VUs  0m08.0s/1m0s

running (0m09.0s), 500/500 VUs, 498654 complete and 0 interrupted iterations
booking_stress   [  15% ] 500 VUs  0m09.0s/1m0s

running (0m10.0s), 500/500 VUs, 550942 complete and 0 interrupted iterations
booking_stress   [  17% ] 500 VUs  0m10.0s/1m0s

running (0m11.0s), 500/500 VUs, 601082 complete and 0 interrupted iterations
booking_stress   [  18% ] 500 VUs  0m11.0s/1m0s

running (0m12.0s), 500/500 VUs, 651172 complete and 0 interrupted iterations
booking_stress   [  20% ] 500 VUs  0m12.0s/1m0s

running (0m13.0s), 500/500 VUs, 702028 complete and 0 interrupted iterations
booking_stress   [  22% ] 500 VUs  0m13.0s/1m0s

running (0m14.0s), 500/500 VUs, 754642 complete and 0 interrupted iterations
booking_stress   [  23% ] 500 VUs  0m14.0s/1m0s

running (0m15.0s), 500/500 VUs, 798856 complete and 0 interrupted iterations
booking_stress   [  25% ] 500 VUs  0m15.0s/1m0s

running (0m16.0s), 500/500 VUs, 846490 complete and 0 interrupted iterations
booking_stress   [  27% ] 500 VUs  0m16.0s/1m0s

running (0m17.0s), 500/500 VUs, 895103 complete and 0 interrupted iterations
booking_stress   [  28% ] 500 VUs  0m17.0s/1m0s

running (0m18.0s), 500/500 VUs, 946103 complete and 0 interrupted iterations
booking_stress   [  30% ] 500 VUs  0m18.0s/1m0s

running (0m19.0s), 500/500 VUs, 995372 complete and 0 interrupted iterations
booking_stress   [  32% ] 500 VUs  0m19.0s/1m0s

running (0m20.0s), 500/500 VUs, 1046516 complete and 0 interrupted iterations
booking_stress   [  33% ] 500 VUs  0m20.0s/1m0s

running (0m21.0s), 500/500 VUs, 1094555 complete and 0 interrupted iterations
booking_stress   [  35% ] 500 VUs  0m21.0s/1m0s

running (0m22.0s), 500/500 VUs, 1146283 complete and 0 interrupted iterations
booking_stress   [  37% ] 500 VUs  0m22.0s/1m0s

running (0m23.0s), 500/500 VUs, 1197997 complete and 0 interrupted iterations
booking_stress   [  38% ] 500 VUs  0m23.0s/1m0s

running (0m24.0s), 500/500 VUs, 1248490 complete and 0 interrupted iterations
booking_stress   [  40% ] 500 VUs  0m24.0s/1m0s

running (0m25.0s), 500/500 VUs, 1302296 complete and 0 interrupted iterations
booking_stress   [  42% ] 500 VUs  0m25.0s/1m0s

running (0m26.0s), 500/500 VUs, 1351477 complete and 0 interrupted iterations
booking_stress   [  43% ] 500 VUs  0m26.0s/1m0s

running (0m27.0s), 500/500 VUs, 1403091 complete and 0 interrupted iterations
booking_stress   [  45% ] 500 VUs  0m27.0s/1m0s

running (0m28.0s), 500/500 VUs, 1453856 complete and 0 interrupted iterations
booking_stress   [  47% ] 500 VUs  0m28.0s/1m0s

running (0m29.0s), 500/500 VUs, 1503768 complete and 0 interrupted iterations
booking_stress   [  48% ] 500 VUs  0m29.0s/1m0s

running (0m30.0s), 500/500 VUs, 1557098 complete and 0 interrupted iterations
booking_stress   [  50% ] 500 VUs  0m30.0s/1m0s

running (0m31.0s), 500/500 VUs, 1600312 complete and 0 interrupted iterations
booking_stress   [  52% ] 500 VUs  0m31.0s/1m0s

running (0m32.0s), 500/500 VUs, 1651795 complete and 0 interrupted iterations
booking_stress   [  53% ] 500 VUs  0m32.0s/1m0s

running (0m33.0s), 500/500 VUs, 1700937 complete and 0 interrupted iterations
booking_stress   [  55% ] 500 VUs  0m33.0s/1m0s

running (0m34.0s), 500/500 VUs, 1751891 complete and 0 interrupted iterations
booking_stress   [  57% ] 500 VUs  0m34.0s/1m0s

running (0m35.0s), 500/500 VUs, 1803992 complete and 0 interrupted iterations
booking_stress   [  58% ] 500 VUs  0m35.0s/1m0s

running (0m36.0s), 500/500 VUs, 1855755 complete and 0 interrupted iterations
booking_stress   [  60% ] 500 VUs  0m36.0s/1m0s

running (0m37.0s), 500/500 VUs, 1908446 complete and 0 interrupted iterations
booking_stress   [  62% ] 500 VUs  0m37.0s/1m0s

running (0m38.0s), 500/500 VUs, 1960665 complete and 0 interrupted iterations
booking_stress   [  63% ] 500 VUs  0m38.0s/1m0s

running (0m39.0s), 500/500 VUs, 2011572 complete and 0 interrupted iterations
booking_stress   [  65% ] 500 VUs  0m39.0s/1m0s

running (0m40.0s), 500/500 VUs, 2062858 complete and 0 interrupted iterations
booking_stress   [  67% ] 500 VUs  0m40.0s/1m0s

running (0m41.0s), 500/500 VUs, 2114249 complete and 0 interrupted iterations
booking_stress   [  68% ] 500 VUs  0m41.0s/1m0s

running (0m42.0s), 500/500 VUs, 2163899 complete and 0 interrupted iterations
booking_stress   [  70% ] 500 VUs  0m42.0s/1m0s

running (0m43.0s), 500/500 VUs, 2214932 complete and 0 interrupted iterations
booking_stress   [  72% ] 500 VUs  0m43.0s/1m0s

running (0m44.0s), 500/500 VUs, 2268299 complete and 0 interrupted iterations
booking_stress   [  73% ] 500 VUs  0m44.0s/1m0s

running (0m45.0s), 500/500 VUs, 2320644 complete and 0 interrupted iterations
booking_stress   [  75% ] 500 VUs  0m45.0s/1m0s

running (0m46.0s), 500/500 VUs, 2370573 complete and 0 interrupted iterations
booking_stress   [  77% ] 500 VUs  0m46.0s/1m0s

running (0m47.0s), 500/500 VUs, 2418418 complete and 0 interrupted iterations
booking_stress   [  78% ] 500 VUs  0m47.0s/1m0s

running (0m48.0s), 500/500 VUs, 2465776 complete and 0 interrupted iterations
booking_stress   [  80% ] 500 VUs  0m48.0s/1m0s

running (0m49.0s), 500/500 VUs, 2517945 complete and 0 interrupted iterations
booking_stress   [  82% ] 500 VUs  0m49.0s/1m0s

running (0m50.0s), 500/500 VUs, 2572957 complete and 0 interrupted iterations
booking_stress   [  83% ] 500 VUs  0m50.0s/1m0s

running (0m51.0s), 500/500 VUs, 2625054 complete and 0 interrupted iterations
booking_stress   [  85% ] 500 VUs  0m51.0s/1m0s

running (0m52.0s), 500/500 VUs, 2677238 complete and 0 interrupted iterations
booking_stress   [  87% ] 500 VUs  0m52.0s/1m0s

running (0m53.0s), 500/500 VUs, 2717247 complete and 0 interrupted iterations
booking_stress   [  88% ] 500 VUs  0m53.0s/1m0s

running (0m54.0s), 500/500 VUs, 2767207 complete and 0 interrupted iterations
booking_stress   [  90% ] 500 VUs  0m54.0s/1m0s

running (0m55.0s), 500/500 VUs, 2818579 complete and 0 interrupted iterations
booking_stress   [  92% ] 500 VUs  0m55.0s/1m0s

running (0m56.0s), 500/500 VUs, 2869466 complete and 0 interrupted iterations
booking_stress   [  93% ] 500 VUs  0m56.0s/1m0s

running (0m57.0s), 500/500 VUs, 2920490 complete and 0 interrupted iterations
booking_stress   [  95% ] 500 VUs  0m57.0s/1m0s

running (0m58.0s), 500/500 VUs, 2972754 complete and 0 interrupted iterations
booking_stress   [  97% ] 500 VUs  0m58.0s/1m0s

running (0m59.0s), 500/500 VUs, 3024343 complete and 0 interrupted iterations
booking_stress   [  98% ] 500 VUs  0m59.0s/1m0s

running (1m00.0s), 500/500 VUs, 3077961 complete and 0 interrupted iterations
booking_stress   [ 100% ] 500 VUs  1m00.0s/1m0s


  █ THRESHOLDS 

    business_errors
    ✓ 'rate<0.01' rate=0.00%

    http_req_duration
    ✓ 'p(95)<500' p(95)=11.97ms


  █ TOTAL RESULTS 

    checks_total.......: 6159911 102654.723816/s
    checks_succeeded...: 58.11%  3579977 out of 6159911
    checks_failed......: 41.88%  2579934 out of 6159911

    ✓ setup event created
    ✓ status is 200 or 409
    ✗ booking accepted
      ↳  16% — ✓ 500021 / ✗ 2579934

    CUSTOM
    booking_duration...............: avg=6.71ms min=0s      med=6ms    max=121ms    p(90)=12ms    p(95)=15ms   
    business_errors................: 0.00%   0 out of 3079955

    HTTP
    http_req_duration..............: avg=4.56ms min=35.5µs  med=3.46ms max=104.07ms p(90)=9.08ms  p(95)=11.97ms
      { expected_response:true }...: avg=3.78ms min=35.5µs  med=2.8ms  max=64.06ms  p(90)=7.52ms  p(95)=10.22ms
    http_req_failed................: 83.76%  2579934 out of 3079956
    http_reqs......................: 3079956 51327.370241/s

    EXECUTION
    iteration_duration.............: avg=9.47ms min=50.66µs med=8.07ms max=132.5ms  p(90)=17.84ms p(95)=21.54ms
    iterations.....................: 3079955 51327.353576/s
    vus............................: 500     min=500                max=500
    vus_max........................: 500     min=500                max=500

    NETWORK
    data_received..................: 588 MB  9.8 MB/s
    data_sent......................: 533 MB  8.9 MB/s



running (1m00.0s), 000/500 VUs, 3079955 complete and 0 interrupted iterations
booking_stress ✓ [ 100% ] 500 VUs  1m0s